uzihao/gd32f10x_firmware_library_gcc_makefile/User/main.c
/*!
    \file  main.c
    \brief running led
    
    \version 2019-6-5, V1.0.0, firmware for GD32VF103
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f10x.h"
#include "systick.h"
#include <stdio.h>

#define DEBUG_USART            USART0
#define DEBUG_USART_GPIO       GPIOA
#define DEBUG_USART_TX_PIN     GPIO_PIN_9

static void debug_usart_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_USART0);

    /* USART0 TX is PA9. RX is not required for this print-only example. */
    gpio_init(DEBUG_USART_GPIO, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
              DEBUG_USART_TX_PIN);

    usart_deinit(DEBUG_USART);
    usart_baudrate_set(DEBUG_USART, 115200U);
    usart_word_length_set(DEBUG_USART, USART_WL_8BIT);
    usart_stop_bit_set(DEBUG_USART, USART_STB_1BIT);
    usart_parity_config(DEBUG_USART, USART_PM_NONE);
    usart_transmit_config(DEBUG_USART, USART_TRANSMIT_ENABLE);
    usart_enable(DEBUG_USART);
}

/* Redirect printf() output to USART0 (PA9). */
int _write(int file, char *ptr, int len)
{
    int index;

    (void)file;
    for(index = 0; index < len; index++) {
        usart_data_transmit(DEBUG_USART, (uint8_t)ptr[index]);
        while(RESET == usart_flag_get(DEBUG_USART, USART_FLAG_TBE)) {
        }
    }
    return len;
}

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    systick_config();
    debug_usart_init();
    printf("GD32F103 booted: USART0 PA9, 115200 8N1\r\n");

    /* enable the LED clock */
    rcu_periph_clock_enable(RCU_GPIOA);
    /* configure LED GPIO port */
    gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);
    gpio_bit_reset(GPIOA, GPIO_PIN_0);

    while(1){
        gpio_bit_set(GPIOA, GPIO_PIN_0);
        printf("heartbeat\r\n");
        delay_1ms(1000);
        gpio_bit_reset(GPIOA, GPIO_PIN_0);
        delay_1ms(1000);
    }
}
